{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution1D", "config": {"batch_input_shape": [null, 15, 300], "W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 2, "init": "uniform", "bias": true, "nb_filter": 1200, "input_dtype": "float32", "subsample_length": 1, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}}, {"class_name": "MaxPooling1D", "config": {"stride": 14, "pool_length": 14, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 3}}]}